propose_prompt = """
输入: 2 8 8 14
可能的下一步行动：
2 + 8 = 10 (left: 8 10 14)
8 / 2 = 4 (left: 4 8 14)
14 + 2 = 16 (left: 8 8 16)
2 * 8 = 16 (left: 8 14 16)
8 - 2 = 6 (left: 6 8 14)
14 - 8 = 6 (left: 2 6 8)
14 /  2 = 7 (left: 7 8 8)
14 - 2 = 12 (left: 8 8 12)
输入: {input}
可能的下一步行动：
"""

value_prompt = """
评估给定的数字是否可以达到24，输出sure(20)/likely(1)/impossible(0.001)，只输出分值
10 14
10 + 14 = 24
left: 20
11 12
11 + 12 = 23
12 - 11 = 1
11 * 12 = 132
11 / 12 = 0.91
left: 0.001
4 4 10
4 + 4 + 10 = 8 + 10 = 18
4 * 10 - 4 = 40 - 4 = 36
(10 - 4) * 4 = 6 * 4 = 24
left: 20
4 9 11
9 + 11 + 4 = 20 + 4 = 24
left: 20
5 7 8
5 + 7 + 8 = 12 + 8 = 20
(8 - 5) * 7 = 3 * 7 = 21
无法达到24, 但数字在合理范围内
left: 1
5 6 6
5 + 6 + 6 = 17
(6 - 5) * 6 = 1 * 6 = 6
无法达到24, 但数字在合理范围内
left: 1
10 10 11
10 + 10 + 11 = 31
(11 - 10) * 10 = 10
10 10 10 太大了
left: 0.001
1 3 3
1 * 3 * 3 = 9
(1 + 3) * 3 = 12
1 3 3 太小了
left: 0.001
{input}
"""


